"Title" = "אחסון";
"Save" = "שמירה:";
"Files" = "קבצים";
"Images" = "תמונות";
"Text" = "טקסט";
"SaveDescription" = "לשנות אילו סוגים של תוכן מועתק יאוחסנו.";
"Size" = "גודל:";
"SizeTooltip" = "מספר פריטי ההיסטוריה לשמירה.\nברירת מחדל: 200.";
"SortBy" = "סידור לפי:";
"LastCopiedAt" = "מועד העותק האחרון";
"FirstCopiedAt" = "מועד העותק הראשון";
"NumberOfCopies" = "מספר עותקים";
"SortByTooltip" = "ברירת מחדל: מועד העותק האחרון.";
"CurrentSizeTooltip" = "גודל נוכחי בדיסק.";
